In [2]:
import numpy as np
import pandas as pd

In [6]:
sportsGroup1 = {"Name": ["Hakan","Selin","Hasan","Serpil"],
          "Sports":["Basketball","Marathon","Fitness","Volleyball"],
          "Calories": [300,130,225,200]}

In [12]:
sports1 = pd.DataFrame(sportsGroup1, index = [0,1,2,3])
sports1

     Name      Sports  Calories
0   Hakan  Basketball       300
1   Selin    Marathon       130
2   Hasan     Fitness       225
3  Serpil  Volleyball       200

In [13]:
sportsGroup2 = {"Name": ["Vedat","Emre","Efe","Mehmet"],
          "Sports":["Football","Basketball","Fitness","Volleyball"],
          "Calories": [120,213,247,229]}

In [18]:
sports2 = pd.DataFrame(sportsGroup2, index =[4,5,6,7])
sports2

     Name      Sports  Calories
4   Vedat    Football       120
5    Emre  Basketball       213
6     Efe     Fitness       247
7  Mehmet  Volleyball       229

In [15]:
sportsGroup3 = {"Name": ["Poyraz","Cagan","Filiz","Sıla"],
          "Sports":["Basketball","Swimming","Badminton","Volleyball"],
          "Calories": [310,230,245,159]}

In [16]:
sports3 = pd.DataFrame(sportsGroup3, index = [8,9,10,11])

In [17]:
sports3

      Name      Sports  Calories
8   Poyraz  Basketball       310
9    Cagan    Swimming       230
10   Filiz   Badminton       245
11    Sıla  Volleyball       159

# Concatenation

In [22]:
sportsFull = pd.concat([sports1,sports2,sports3], axis = 0)
sportsFull

      Name      Sports  Calories
0    Hakan  Basketball       300
1    Selin    Marathon       130
2    Hasan     Fitness       225
3   Serpil  Volleyball       200
4    Vedat    Football       120
5     Emre  Basketball       213
6      Efe     Fitness       247
7   Mehmet  Volleyball       229
8   Poyraz  Basketball       310
9    Cagan    Swimming       230
10   Filiz   Badminton       245
11    Sıla  Volleyball       159

# Merge

In [23]:
dict1 = {"Name": ["Hakan","Selin","Serpil","Hasan"],
         "Sport": ["Basketball","Volleyball","Marathon","Tennis"]
        }

In [25]:
dataFrame1 = pd.DataFrame(dict1)
dataFrame1

     Name       Sport
0   Hakan  Basketball
1   Selin  Volleyball
2  Serpil    Marathon
3   Hasan      Tennis

In [26]:
dict2 = {"Name": ["Hakan","Selin","Serpil","Hasan"],
         "Calories": [100,200,150,250]
        }

In [27]:
dataFrame2 = pd.DataFrame(dict2)
dataFrame2

     Name  Calories
0   Hakan       100
1   Selin       200
2  Serpil       150
3   Hasan       250

In [28]:
pd.merge(dataFrame1, dataFrame2, on = "Name")

     Name       Sport  Calories
0   Hakan  Basketball       100
1   Selin  Volleyball       200
2  Serpil    Marathon       150
3   Hasan      Tennis       250